app/controllers/api/v1/accepted_bookings_controller.rb

SELECT "accepted_bookings".* FROM "accepted_bookings"
---
    def index
        accepted_bookings = AcceptedBooking.all

SELECT "accepted_bookings".* FROM "accepted_bookings" WHERE "accepted_bookings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        accepted_bookings = AcceptedBooking.find(params[:id])