app/controllers/api/v1/bookings_controller.rb

    def index
        bookings = Booking.all
---
SELECT "bookings".* FROM "bookings"

    def show
        booking = Booking.find(params[:id])
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        user_id = params[:user_id]
        name = params[:name]
        email = params[:email]
        phone = params[:phone]
        address = params[:address]
        datetime = params[:datetime]
        message = params[:message]

        booking = Booking.create( user_id: user_id, name: name, email: email, phone: phone, address: address, datetime: datetime, message: message)
---
INSERT INTO "bookings" ("user_id", "name", "email", "phone", "address", "datetime", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"