app/controllers/api/v1/messages_controller.rb

SELECT "messages".* FROM "messages"
---
    def index
        messages = Message.all

INSERT INTO "messages" ("user_id", "name", "email", "phone", "content", "datetime", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        user_id = params[:user_id]
        name = params[:name]
        email = params[:email]
        phone = params[:phone]
        content = params[:content]
        datetime = params[:datetime]

        message = Message.create(user_id: user_id, name: name, email: email, phone: phone, content: content, datetime: datetime)