app/controllers/api/v1/thrashes_controller.rb

SELECT "thrashes".* FROM "thrashes"
---
    def index
        thrashes = Thrash.all

SELECT "thrashes".* FROM "thrashes" WHERE "thrashes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        thrash = Thrash.find(params[:id])